{
  "markdown": "Markdown is a lightweight markup language with plain text formatting syntax\ndesigned so that it can be converted to HTML and many other formats \nusing a tool by the same name. Markdown is often used to format readme files, for \nwriting messages in online discussion forums, and to create rich text using a plain text editor.",
  "html" : "HyperText Markup Language (HTML) is the standard markup language\nfor creating web pages and web applications.\nWith Cascading Style Sheets (CSS), and JavaScript, it forms a triad of cornerstone technologies for the World Wide Web.\nWeb browsers receive HTML documents from a webserver or from local\nstorage and render them into multimedia web pages.\nHTML describes the structure of a web page semantically and originally\nincluded cues for the appearance of the document.",
  "css" : "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language. Although most often used to set the visual style of web pages and user interfaces written in HTML and XHTML, the language can be applied to any XML document, including plain XML, SVG and XUL, and is applicable to rendering in speech, or on other media.",
  "sass" : "Sass (syntactically awesome stylesheets) is a style sheet language initially designed by Hampton Catlin and developed by Natalie Weizenbaum. After its initial versions, Weizenbaum and Chris Eppstein continued to extend Sass with SassScript, a simple scripting language used in Sass files.",
  "less" : "Less (sometimes stylized as LESS) is a dynamic style sheet language that can be compiled into Cascading Style Sheets (CSS) and run on the client side or server side. Designed by Alexis Sellier, Less is influenced by Sass and has influenced the newer `SCSS` syntax of Sass, which adapted its CSS-like block formatting syntax.",
  "js" : "JavaScript (ˈdʒævəˌskrɪpt) is a high-level, dynamic, untyped, and interpreted programming language.\nIt has been standardized in the ECMAScript language specification.\nAlongside HTML and CSS, JavaScript is one\nof the three core technologies of World Wide Web content production;\nthe majority of websites employ it, and all modern Web browsers support it without the need for plug-ins.\nJavaScript is prototype-based with first-class functions [...]",
  "json" : "In computing, JSON (canonically pronounced /ˈdʒeɪsən/ jay-sən; sometimes JavaScript Object Notation) is an open-standard format that uses human-readable text to transmit data objects consisting of attribute–value pairs. It is the most common data format used for asynchronous browser/server communication, largely replacing XML which is used by Ajax.",
  "php" : "PHP is a server-side scripting language designed primarily for web development but also used as a general-purpose programming language. Originally created by Rasmus Lerdorf in 1994 the PHP reference implementation is now produced by The PHP Development Team.6] PHP originally stood for Personal Home Page,5] but it now stands for the recursive acronym PHP: Hypertext Preprocessor.",
  "cpp" : "C is the third letter in the English alphabet and a letter of the alphabets of many other writing systems which inherited it from the Latin alphabet. It is also the third letter of the ISO basic Latin alphabet. It is named `cee` (pronounced) in English."
}
